Intro conditions:
-rainy, enter sewer
-enter sewer w strange bun
-hasitem dwarf translation guide
-not on friday

Sprites: none

Scheds: none

Loves:
Likes:
Neuts:
Dislikes:
Hates:

Shop:

Gen quests:
-Krobus 'random' quests = unlock conditions; metal bars, basalt/limestone for beter bonding, slay bats for Ambu, get fish, some quests y wizard/marlonletter etc

Sequence:
-Intro event
-

Sanctuary events:
-

Char Notes:
-shadow people have lots of cash that they find lying around, that's why they can pay for stuff


-SpareRoom for initial spawns; easter egg cutscene welcoming farmer there (if you happen to see this scene, comment on nexus or ping me on discord with the word 'elephant'. No particular reason, I just really like elephants :D
-Event: Lewis hires someone to clean out sewers, Krobus has to hide in the bug lair for a few days and farmer has to run interference (either successfully heads off cleaners, or has to convince them to keep secret)
-Voth: 'How did i get my boat down here? ... That's not important.'; party room: 'Hi! I'm Voth. I'm a new character Si's currently working on. Hope to meet you soon!'
-Vigil scene: black screen, torches appear one by one, fade into lit scene w shadows holding them. On torch sparks before being lit.
-use CC for sea monster?
-vigil: reg event, starts when add torch to stairs, can purchase one during event (or if none, R offers 'i always have a spare!')
-optional event pack where the sanctuary makes peace w the dwarf and they start attending the vigil and visiting to trade
-Fetta Bellum Ambu Yubu Morprit Serif Glee Duffle Nib Chenchi Zull
-Radish the Bat/Onion?
-set char anti and exclu, then do sprites and basic portraits, then test w Adam and WIP
-shadow person: cauldron top, head fades into bubbles/specks floating off
-Diagol - hammock at small piles behind Chenchi
-star shaped shadow person
-joker shaped
-splayed out floating ponytail on top
-event where Glee gives you a painting 'do you like it? Ypi can have it' also male one painting a polyam flag
-future npc: round with a hole/donut shaped
-Vaun: sets up a yearly market on a rug, like Reda
-future updates: can upgrade houses, add decor
-gen idea: when news show up,stay in temp place while build them a house?
-Diagol: event where farmer about to fight them, they plead don't want to fight, farmer takes them to the sanctuary
-make Rath a sep npc; vase merchant = Vaun Varug Varus
-Rath is a thief (first seen stealing from the sanctuary, then have to track down) who thinks they're fine on their own and only comes back to the sanctuary because they're hurt and need heals
-secret path -> open up area for other peoples' npcs?
-romance: Yubu; roommate: Bellum, Ambu, Rath, Diagol, Vaun, Rummel (+adopt Nib), trio (w free love); rival hearts: Rath & Diagol; release as separate packs?
-Barril -> Seris? Serif?