TO DO

Event ID most recent: 262205064
Put Krobus quests in dialogue, so have to talk to them to get quest? ConvoTopics (limited length tho, but useful for timing other stuff)

need compat w underdark sewer map

One day a year each char goes to quest board

Sprites: Zull's bandana changes colors, Glee only sometimes covered in paint after arriving, Fetta only gets leaves after GH, different book colors for Ambu, different pirate eyes for Yubu, mask on/off for Chenchi
Chenchi's masks: purple = vigil/funerals, gold = weekly, pink = war, green = making potions, red = ?

CTs
SSStrangeBun1: why did I ask for a strange bun? no special reason, I just wanted to try offering one to that weird statue over there. now i feel like I'm better at building stuff for some reason.

"marriage" ceremonies in the lair (add one if get with Krobus too)


	// Voth
	// Winter;

	// Rath
	// Fall; (Caught stealing from lair, player chases after, falls, hurt, returns to heal)

	// Diagol
	// Mines/GI; (doesn't want to fight, player brings back)



	// later event between Marlon and the colony/Bellum

	// later quests: marlon wants an arti trove, wiz wants an island totem
	// quest where can bring x or y, determines which of 2 chars appears first?

two versions of wiz visit - one if farmer has sup cuc, one if not? Ditto for guild?

Small events when you go to Marlon for advice


-Events
	Event: Lewis stops player in town and mentions renovating the sewers, need to choose excuse... (at some pt?)
	Event: need to discourage kids from exploring the sewers/make them feel better about more noises down there (Ambu quickly hid nearby, have to help them get out of this one)
--Fenna
	Meeting
	Quest: Fenna's Greenhouse
	Quest: get <season> seeds
--Bellum
	First Meeting
	Second Meeting
	Quest: Make Defenses 'The Best Offense'
	Quest: Make Weapons 'The Best Defense'
--Ambu
	Meeting
	Quest: Find/Fix Glasses
	Quest: rescue mission (save Yubu from surface; sneak to sewer, but crowd near it and near forest entrance; sneak around via beach? Distraction? Mines? 'Oh Yoba Yubu hasn't returned yet, please go find them!')
	Future update: Onion
--Yubu
	Meeting
	Quest: Adventure
	Quest: battery for radio
	Future update: magic
--Morprit
	Meeting
	Quest: fishing lure (plenty of bait around)
	Quest: new rod
--Barril
	Meeting
	Quest: need metals
	Changes phases of the moon
--Glee
	Meeting
	Quest: berries for dyes
--Rummel
	Meeting
	Quest: find Nib
	Quest: medicine for Nib
--Nib
	Meeting
	Quest: get snack
--Chenchi
	Meeting
	Question: vigil line
	Vigil
	Vigil: needs mats to make mask
--Gulm
	Meeting
	Quest: Find chickens
	Flat arc (ratdog chat);
		Finds really big void egg
		Turns out to be a void goose
		Needs farmer's help taming it
		Explains trust issues
--Rath
	Future update

-Shops
--Fenna
--Gulm
--Morprit?

Assets
-ornate tea set (this tea set includes a kettle with a timer) (daily tea)
-void tea
-solar tea
-lost chickens (trash)

-Schedules
--Fenna
--FennaGH
--Jume
--Ambu
--Mubu
--Morprit
--Barril
--Glee
--Rummel
--Nib
--Chenchi
--Gulm

-Dialogue
--Fenna -> finish 'Starting The Colony' quest
--Jume
--Ambu
--Mubu
--Morprit
--Barril
--Glee
--Rummel
--Nib
--Chenchi
--Gulm
---Map Strings

-Images ALL

Residents
-S1 Fenna
-S2 Jume Bellum
-S3 Mubu Yubu
-S4 Ambu
-3S1 Morprit
-3S2 Glee
-3S3 Barril
-Parent Rummel
-Child Nib: meet Rummel, carry <snack> (R: "try carrying snack, Nib loves those!), enter <location>
-Shaman Chenchi
-Void Gulm Zull
-Vase Beval Voth Woth Rath enter LATER

-Sea monster (make antisocial npc and set some sprites as null)

Shops
-Gulm: can buy void eggs and mayo; after finishing quest, can get 1 free void mayo per day STF (+dga/ja void chicken items)
-Fenna: Bug steaks, veggie dishes
-Beval/Voth: Vases
-Morprit: random fish each day
-Glee: paintings?

Festivals
-when dayofyear, change mapwarp to fest map and charscheds to festsched
-Not sure abt fstevent yet tho
-check RSV, they don't use code for fests

Quests
-Begin Colony (multi part questline)
	Finish magic ink quest (check if other mods use lair)
		event id?
	Bring Krobus stone, clay, etc. Basalt, limestone etc? (Smaller quests)
	K: 'we need to convince marlon and the wizard to allow it. What if they don't? Hmm... I know! You should take a gift for them. What do they like? Oh! how about a slime eg for marlon and a super cucumber for the wizard?' w: 'hmph, I don't think it's a good idea, but I suppose there's no stopping you is there. Now leave me to my studies. <sup cuc disappears> and I'm keeping this!' m: 'you two want to start a village of shadw people under the town? Seriously? <item appears> are you trying to bribe me? Chuckle, well it's working. I'll allow it, but understand this: you will be responsible for them.' later event between Marlon and the colony/Bellum
	Go to the bottom of the mines (set event 'enter bottom of mines'?) (string 'you leave the note. Now you can only wait.')
-Gulm: find all the void chickens; 10h Gulm, can enter yard and pet chickens; quest to collect fence mats before they appear
-Rummel: find Nib; herbs for sick Nib
-Fenna: mats for greenhouse (quartz, clay, copper); seeds
-Jume
	Drags you into some conspiracy hunts; 'checking for dwarves' 'investigating mysterious sounds/things = animals/pets'
-Beval/Vath: 'hey can you tell off anyone you see running off w my vases during the night market? thanks' = night market cutscene?
-Daily quests
	Quest Framework
	cloth, seeds for Fenna, herbs for Rummel, potions for Rummel/Bellum, minerals (limestone, basalt etc), fishing tackle for Morprit, iron bars for Barril 'B would like some iron bars please, Morprit), ingredients (oil etc) for Fenna, dolls for Nib
-Colony quests
	-big quest in fall: 'it's getting chilly, can you get lots of cloth for us?' once done, every winter all sprites will wear ponchos/scarves
	-10 slate, 10 granite, 10 limestone, 10 marble

Change ambient music?
Someone gets a pet. A bat? A grub/fly?

Mini event: Lewis gets a mysterious tax payment. Mentions it covers 10 people and one dependent, but he's not sure where it came from. 'dont worry, i'll make sure it's put to good use!'

Event: morprit 'you make really god weapons!' bellum 'uh thanks' morprit 'you should hang out with barril, they like crafting stuff'

Krobus: 'strange buns are a traditional dish for my people. I don't really like it though.'

Questions:
-how to spawn an item the player can pick up
-can you make 'hidden' quests that don't appear in the quest log but can get completed?

DONE

Maps
-ROOMS- Complete rooms for now with 'not settled yet' msg till all in
-WARPS- Need conditions
-TARPS- Need conditions

Characters

Assets

Quests
	Chickenquest: ]TheFrenchDodo [NPC Rodney]: Regarding my previous issue, if anyone wants to spawn an item in an artifact spot, note that the items in Data/Locations should be sorted by probability. So I set the lowest probability and used "Prepend" instead of "Append" as an operation and now it works 

Shops




-map string 'Fetta's House' etc
-load separate gift likes field on fridays for chars that don't speak
-Serif's void pendent hangs off the edge of their crescent top
-Mateo clinic scene: introduce them to sanctuary?
-joining ceremony platonic
-Roa loves new tech and being online
-Mimsy appears after all other initial villagers appear (+hearts w Tove), and acts as the 'trauma level' indicator of the colony, so scenes when all members at certain hearts (gets agitated when Rath appears, ill/tired when Pax appears)
-Bellum 10h scene calmly petting Mimsy and chuckling
-quest title: rock rock, ru's rere?
-find diagol in the quarry and Roa in skull caverns. Rath is a thief, you have to track them down...
-Roa builds a robot? Named cookies/cake
-Kronus comes out as he him; Chenchi keeps making mistakes and has to be corrected on casual bigotry but does try; Bellum needs convincing; Yubu needs to learn to stop asking 1001 questions (Krobus is not an obligated learning tool); kids accept without any fuss
-give all shadows convotopics for each other's intro events
-flora and phana: phana needs the weeds fresh, so have to harvest them for quest too; also need five each of spring, summer, fall, winter seeds; plus some clay and fertilizer; mixed seeds are a liked gift
-to trigger vaun, enter sanctuary during market winter weekdays after visiting night market at least once after meeting phana
-Roa wants to order something online; event where you choose to give them cash for it (cash gets deducted from you) then days later the item shows up in your mailbox foe you to give to Roa (choosing no will reduce hearts w Roa, and Roa will find the item themself per a CT)
-Late chars each require hearts w villagers: Bellum (Chenchi, Tove/Mimsy), Rath (Duffle, Nib), Pax (Ambu, Yubu), Argil (trio)
-Bellum maybe more?
-Roa requires hearts with Rath, Pax, Argil
-Duffle CT, a bunch of villagers saw something around mountain/tracks
-Yoba Statue: 'you consider taking a short break: drinking some water, resting your eyes, and perhaps a brief walk around the room to rejuvenate yourself before continuing the day's adventure'
-fun future quirk: if you meditate every day for a week Chenchi will offer you some tea (in the mail maybe)
-scene w Chenchi and Bellum having tea together
-have trio appear in party room/shadow realm before know recipes, events req recipes to be invoked
-during night market Argil is on boat all day 
-Phana quest for tea bush because Chenchi wants tea. Cond for Bellum?
-'as shadows we don't need much rest, unless we get tired from fighting or working'
-'gender is a very new concept to us shadows. Many of us stick to what we're used to, but it's so nice to see the young ones making discoveries about themselves! I will admit, i do still make mistakes when referring to krobus. I hope they - i mean he! - forgives me.'
-poncho update: during quest, morprit 'serif is happy to make one for anyone who asks for one!'; after quest, each time player visits lair, hidevent w 1 day ct delay, each hidevent activates a new shadow's poncho sprites so over time more npcs wear them
--make hidevents in char events, so you can gt poncho update before some villagers