Intro conditions:
-enter lair w v egg?
-letter from K: a new person has said they'll join! It'll take them some time to arrive though. They asked me to prepare a few things they'll need. Could you get me some x please? need 40 iron then z appears in spring (or get mail in spring, then z appears after delay)

Sprites:

Scheds:

Shop:
-unlocked by chickenquest
-5 void eggs a day
-1 void goose egg a week
-void goose egg recipes and machines

Gen quests:
-hay for chickens
-mixed seeds for chickens
-cloth for bandanas

Sequence:
-Intro event
-chickenquest 'The Chicken Or The Egg' or 'Which Came First'
-void goose

Sanctuary events:
-use as 'invis conds' for other heart events?

Char Notes:
-happy to finally have a steady space for chicks, had to have them follow Z around before
-oh no my chickens, anyway have some mayo
-The voice of reason/wisdom in the community bc the shaman sure ain't it lmao
-farmer gets advice from a fellow farmer
-void goose eggs that don't work like regular eggs
-flat arc char where they don't grow much, but help the player understand the experiences of the other shadow people and why they have difficulty trusting others by taming a void goose
-add an action trigger mail event thingy to the string when petting each chicken, and an event that happens once each chicken has been petted once lol (maybe that triggers the chickeb quest? Or the goose)
-secret: you can put hay in the hay bin at tove's, doing so adds friendship, if you put in enough they'll give you a coffee machine in thanks; ditto for seeds for Phana, bait for Morprit, wood for Serif, paper for Glee etc (use UB? Can it do it without showing what's needed so it stays a mystery?)
-rare dialogue where chickens roll an egg towards you (maybe on their supposed birthdays)


Chicken Quest
-check Rodney NPC for fishing/artifact custom item spawns
-chickens get loose, have to find them all (sea monster has one, fish it out; break a vase to get another; one escaped to the surface (interact with bush near Marnie's); one in the luau soup pot (or other fests; maybe in all fests but once found isn't in others; egg fest under table, winter star in one of the gifts); ginger island; desert; movie movie theater vending machine)
Lots so it's an extended quest
Added if other mods installed (ES: hanging out with Emperor, found by Lexi; RSV: with ninjas, Jeric; Caverns: found by the dwarves, who have never seen a chicken before; zuzu city; ghost town; friendly witch hanging out with ghost/slippy: amelia's plane cockpit; pet shelter; hanging out with Apples
-chickenquest: PFM recycle chickens into eggs and vice versa
-rare spawn trash items, monster loot
-chicken quest - the collectible void chickens become a rare animal goods drop by other chickens lol
-possibly put one quest chicken in a specific place in the lair right after quest starts (or on the farm? Or maybe an event where farmer walking sees one, it jumps clucks and scurries away) so player knows what to look for
-Tove gives a book they're writing on void chickens (either 'caring for void chickens' or 'benefits of void mayo') which increases void egg and mayo value 'this one is signed, of course!'

Make Mimsy events/stuff separte so easier to make individual later